Project 5 OnTrack/app/controllers/data_scraper_controller.rb

SELECT "class_names".* FROM "class_names" WHERE "class_names"."name" = ? LIMIT ?  [["name", "CSE 1110 Introduction to Computing Technology U 3"], ["LIMIT", 1]]
SELECT 1 AS one FROM "class_names" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "class_names" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CSE 1110 Introduction to Computing Technology U 3"], ["created_at", "2020-04-04 20:48:36.257313"], ["updated_at", "2020-04-04 20:48:36.257313"]]
---
  def scrape
    if ClassName.any?
      redirect_to :action => 'list'
      return
    end
    secondary_names = []
    # Gets the web page and makes it parseable
    agent = Mechanize.new
    page = agent.get("https://web.cse.ohio-state.edu/oportal/schedule_display")
    form = page.form_with(:dom_id => 'filter')
    form.field_with(:name => 'strm').options.each do |semester|
      semester.click
      semester_page = form.submit.parser
      course_list = semester_page.css('div.panel')
      course_list.each do |course|
        # Obtains the course title from the div.panel-heading element
       full_title = course.css('div.panel-heading').text.strip.to_s
       class_name = ''
       if !secondary_names.include?(full_title)
        class_name = ClassName.create(name: full_title)
        secondary_names.unshift(full_title)
       else
        class_name = ClassName.find_by(name: full_title)

SELECT "teachings".* FROM "teachings"
---
  def list
    @names = ClassName.all
    @course = Teaching.all