Project 5 OnTrack/app/controllers/student_application_controller.rb

SELECT "class_names".* FROM "class_names"
---
    def new
        @classNames = ClassName.all