Project 5 OnTrack/app/views/data_scraper/list.html.erb

      <tr>
        <td><%= @names.find(c.class_name_id).name %></td> <!-- Course (ex: CSE 3901) -->
---
SELECT "class_names".* FROM "class_names" WHERE "class_names"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]