Project 5 OnTrack/app/views/student_application/new.html.erb

    function addCourse() {
        fetch('../student_application/new.json', {method: 'GET'})
            .then(response => response.json())
            .then(json => {
                var tbody = document.getElementById('course_list');
                var newCourse = document.createElement('tr');
                var courseSelection = document.createElement('td');
                var courseText = document.createElement('select');
                if(courseArray.length == 0) {
                    courseText.class = 0;
                    courseArray.push(Number(courseText.class));
                }else {
                    courseText.class = Number(courseArray[courseArray.length - 1]) + 1;
                    courseArray.push(Number(courseText.class));
                }
                courseText.addEventListener('change', function(){
                    timeOnCourse(json.descriptions, json.meetings, courseText);
                    newCourse.class = courseText.value;
                    });
                var arrayCourse = [];
                json.classNames.forEach(element => {
                    var shortName = element.name.split(' ');
                    var courseOption = document.createElement('option');
                    courseOption.value = element.name;
---
SELECT "class_names".* FROM "class_names"